Revit 2021.1 API
InternalDefinition Members
The InternalDefinition type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the InternalDefinition
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId
 Gets the identifier of the spec describing values of the parameter.
 (Inherited from Definition.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetAllowVaryBetweenGroups
 Whether or not the parameter values can vary across group members.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BuiltInParameter
 Tests whether this definition identifies a built-in parameter or not.
Id
 The id of the parameter.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Name
The user-visible name for the parameter.
 (Overrides Definition.Name.)
ParameterGroup
 Id of a built-in parameter group to which the parameter defined by this definition belongs.
 (Overrides Definition.ParameterGroup.)
ParameterType
Returns the user-visible interpretation of the parameter data.
 (Overrides Definition.ParameterType.)
UnitType |  Obsolete.
 Returns the UnitType of the parameter definition.
 (Inherited from Definition.)
VariesAcrossGroups
Whether or not the parameter values can vary across group members.
Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace